ka2_2024/src/Enums/СпособыПолученияМатериаловВСпецификации/СпособыПолученияМатериаловВСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолученияМатериаловВСпецификации</name>
  <enumValues>
    <name>Обеспечивать</name>
  </enumValues>
  <enumValues>
    <name>ПроизвестиПоСпецификации</name>
  </enumValues>
  <enumValues>
    <name>ПроизводитсяНаЭтапе</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособленногоУчетаТоваров</name>
    <type>
      <types>EnumRef.ВариантыОбособленногоУчетаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеМаршрутнымиЛистами</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПооперационногоУправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоБезЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписаниеЗатратНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПолуфабрикатов</name>
    <type>
      <types>EnumRef.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеУправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМатериалыВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВыходныеИзделияВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОформленияВыработки</name>
    <type>
      <types>EnumRef.ПериодичностьОформленияВыработкиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифныеСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБригадныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПерсональныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНастройкиГрафикаРаботы</name>
    <type>
      <types>EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСменныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОрганизацийПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентРастяженияГрафикаПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/CommonModules/ОбеспечениеПроизводства/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ПараметрыОбеспечения

// Возвращает параметры обеспечения номенклатуры
//
// Параметры:
//  Номенклатура	 - СправочникСсылка.Номенклатура - Номенклатура для которой нужно получить параметры обеспечения.
//  Характеристика	 - СправочникСсылка.ХарактеристикиНоменклатуры - Характеристика номенклатуры.
//  Подразделение	 - СправочникСсылка.СтруктураПредприятия - Подразделение для которого нужно получить параметры обеспечения.
// 
// Возвращаемое значение:
//  Структура - Содержит свойства: Склад.
//
Функция ПараметрыОбеспеченияНоменклатуры(Номенклатура, Характеристика, Подразделение) Экспорт

	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаМатериалов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаМатериалов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	
	СтрокаМатериал = ТаблицаМатериалов.Добавить();
	СтрокаМатериал.Номенклатура = Номенклатура; 
	СтрокаМатериал.Характеристика = Характеристика;
	СтрокаМатериал.Подразделение = Подразделение;
	
	ПараметрыОбеспечения = ПараметрыОбеспеченияСпискаНоменклатуры(ТаблицаМатериалов);
	
	НастройкаОбеспечения = Новый Структура;
	НастройкаОбеспечения.Вставить("Склад", ПараметрыОбеспечения[0].Склад);

	Возврат НастройкаОбеспечения;
	
КонецФункции

// Возвращает параметры обеспечения списка номенклатуры
//
// Параметры:
//  ТаблицаМатериалов	 - ТаблицаЗначений - содержит колонки Номенклатура, Характеристика, Подразделение
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки Склад.
//
Функция ПараметрыОбеспеченияСпискаНоменклатуры(ТаблицаМатериалов) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаМатериалов.Номенклатура КАК Справочник.Номенклатура)                 КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаМатериалов.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(ТаблицаМатериалов.Подразделение КАК Справочник.СтруктураПредприятия)        КАК Подразделение
	|ПОМЕСТИТЬ ВТТаблицаМатериалов
	|ИЗ
	|	&ТаблицаМатериалов КАК ТаблицаМатериалов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаМатериалов.Номенклатура   КАК Номенклатура,
	|	ТаблицаМатериалов.Характеристика КАК Характеристика,
	|	ТаблицаМатериалов.Подразделение КАК Подразделение,
	|	&ТекстПоляСкладМатериалов КАК Склад
	|ИЗ
	|	ВТТаблицаМатериалов КАК ТаблицаМатериалов,
	|
	|	#ТекстСоединенияДляПолученияСкладаМатериалов";
	
	ТекстЗапросаДляПолученияСклада = ТекстЗапросаНастройкиПередачиМатериалов(
		"ТаблицаМатериалов", "Подразделение", Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения);
						
	ТекстЗапроса = СтрЗаменить(
						ТекстЗапроса, 
						"#ТекстСоединенияДляПолученияСкладаМатериалов",
						ТекстЗапросаДляПолученияСклада.ТекстСоединения);
						
	ТекстЗапроса = СтрЗаменить(
						ТекстЗапроса, 
						"&ТекстПоляСкладМатериалов",
						ТекстЗапросаДляПолученияСклада.ТекстПолеСклад);
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаМатериалов", ТаблицаМатериалов);
	Запрос.УстановитьПараметр("СкладПоУмолчанию", Справочники.Склады.СкладПоУмолчанию());
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыОбеспечения = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПараметрыОбеспечения;
	
КонецФункции


#КонецОбласти

#Область Прочее

// Функция возвращает структуру способа получения материалов по умолчанию
// 
// Возвращаемое значение:
//  Структура - способы получения материалов по умолчанию.
//
Функция СтруктураСпособыПолученияМатериаловПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Склад", ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка"));
	Результат.Вставить("ЗаказатьНаСклад", Истина);
	Результат.Вставить("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется"));
	Результат.Вставить("Обособленно", Ложь);
	Результат.Вставить("Запланировать", Ложь);
	
	Результат.Вставить("ДатаПотребности", '00010101');
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает пустую таблицу, для выборки способов получения материалов в производство.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица материалов.
//
Функция СоздатьИсточникВыбораСпособовПолученияМатериалов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0)));
	
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	
	Таблица.Колонки.Добавить("ПроизводитсяВПроцессе", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ПроизводствоНаСтороне", Новый ОписаниеТипов("Булево"));
	
	Таблица.Колонки.Добавить(
		"СпособПолученияМатериала", 
		Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПолученияМатериаловВСпецификации"));
	
	Таблица.Колонки.Добавить(
		"ИсточникПолученияПолуфабриката", 
		Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства,СправочникСсылка.РесурсныеСпецификации"));
	
	Возврат Таблица;
	
КонецФункции

// Функция возвращает способ получения материала для этапа производства по умолчанию.
//
// Параметры:
//  ДанныеЗаказа	 - Структура - структура данных заказа:
//  	* Распоряжение           - ДокументСсылка.ЗаказНаПроизводство2_2 - заказ на производство
//  	* ПодразделениеДиспетчер - СправочникСсылка.СтруктураПредприятия - Подразделение, ответственное за выполнение заказа
//  	* Назначение             - СправочникСсылка.Назначения - назначение обособленной потребности
//  	* НачатьНеРанее          - Дата - дата, не ранее которой необходимо начать производить.
//  ДанныеМатериала	 - Структура - структура данных материала:
//  	* Подразделение          - СправочникСсылка.СтруктураПредприятия - подразделение-получатель
//  	* ПроизводствоНаСтороне  - Булево - признак, что производство выполняется на стороне
//  	* Номенклатура           - СправочникСсылка.Номенклатура - материала, для которого определяется настройка
//  	* Характеристика         - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика материала, для которого определяется настройка
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит временные таблицы используемые для получения способа обеспечения:
//        ВтСпособыПолученияМатериалов - Временная таблица с полями Номенклатура, Характеристика, Назначение, Склад, Обособленно.
//  ВариантЗаполненияОбеспечения	 - ПеречислениеСсылка.ВариантыЗаполненияОбеспеченияПроизводства - Вариант заполнения обеспечения
// 
// Возвращаемое значение:
//  Структура - Содержит свойства:
//  	* Склад - СправочникСсылка.Склады - Склад, с которого передаются материалы в подразделение.
//  	* ЗаказатьНаСклад - Булево - признак, материал необходимо заказать на склад
//  	* ВариантОбеспечения - ПеречислениеСсылка.ВариантыОбеспечения - вариант обеспечения
//  	* Запланировать - Булево - признак, материал возможно.
//
Функция СпособПолученияМатериалаПоУмолчанию(ДанныеЗаказа, ДанныеМатериала, МенеджерВременныхТаблиц = Неопределено, ВариантЗаполненияОбеспечения = Неопределено) Экспорт
	
	НастройкаПередачиМатериалов = СтруктураСпособыПолученияМатериаловПоУмолчанию();
	
	Если ЗначениеЗаполнено(ДанныеМатериала.Подразделение)
		И ЗначениеЗаполнено(ДанныеМатериала.Номенклатура) Тогда
		
		ТаблицаМатериалов = Новый ТаблицаЗначений;
		ТаблицаМатериалов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
		ТаблицаМатериалов.Колонки.Добавить("ПроизводствоНаСтороне", Новый ОписаниеТипов("Булево"));
		ТаблицаМатериалов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаМатериалов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаМатериалов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		
		ЗаполнитьЗначенияСвойств(ТаблицаМатериалов.Добавить(), ДанныеМатериала);
		ЗаполнитьЗначенияСвойств(НастройкаПередачиМатериалов, СпособыПолученияМатериаловПоУмолчанию(ДанныеЗаказа,ТаблицаМатериалов,,ВариантЗаполненияОбеспечения)[0]);
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(НастройкаПередачиМатериалов);
	
КонецФункции

// Функция возвращает способы получения материалов для этапов производства по умолчанию.
//
// Параметры:
//   ДанныеЗаказа - Структура - структура данных заказа:
//       * Распоряжение           - ДокументСсылка.ЗаказНаПроизводство2_2 - заказ на производство
//       * ПодразделениеДиспетчер - СправочникСсылка.СтруктураПредприятия - Подразделение, ответственное за выполнение заказа
//       * Назначение             - СправочникСсылка.Назначения - назначение обособленной потребности
//       * НачатьНеРанее          - Дата - дата, не ранее которой необходимо начать производить.
//   ТаблицаМатериалов - ТаблицаЗначений - таблица материалов этапа
//							Обязательные поля: Номенклатура, Характеристика, Подразделение, ПроизводствоНаСтороне,
//							Дополнительные поля: ПроизводитсяВПроцессе, СпособПолученияМатериала, ИсточникПолученияПолуфабриката.
//
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит временные таблицы используемые для получения способа обеспечения:
//        ВтСпособыПолученияМатериалов - Временная таблица с полями Номенклатура, Характеристика, Назначение, Склад, Обособленно.
//  ВариантЗаполненияОбеспечения	 - ПеречислениеСсылка.ВариантыЗаполненияОбеспеченияПроизводства - Вариант заполнения обеспечения
//
// Возвращаемое значение:
//   - ТаблицаЗначений - таблица материалов, дополненная способами получения материалов:
//       * НомерСтроки - Число - номер строки исходной таблицы
//       * Номенклатура - СправочникСсылка.Номенклатура - материала, для которого определяется настройка
//       * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика материала, для которого
//                                                                        определяется настройка
//       * Подразделение - СправочникСсылка.СтруктураПредприятия - подразделение-получатель 
//       * ПроизводствоНаСтороне - Булево - признак, что производство выполняется на стороне
//       * Склад - СправочникСсылка.Склады - Склад, с которого передаются материалы в подразделение. 
//       * ЗаказатьНаСклад - Булево - признак, материал необходимо заказать на склад
//       * ВариантОбеспечения - ПеречислениеСсылка.ВариантыОбеспечения - вариант обеспечения
//       * Запланировать - Булево - признак, материал возможно.
//
Функция СпособыПолученияМатериаловПоУмолчанию(ДанныеЗаказа, ТаблицаМатериалов, МенеджерВременныхТаблиц = Неопределено, ВариантЗаполненияОбеспечения = Неопределено) Экспорт
	
	Если ТаблицаМатериалов.Колонки.Найти("Склад") = Неопределено Тогда
		ТаблицаМатериалов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	КонецЕсли;
	
	ТекстЗапроса = "";
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВтСпособыПолученияМатериалов") = Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса
			+ ТекстЗапросаВТСпособыПолученияМатериаловПустая();
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВтФорматыСкладов") = Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса
			+ Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов(Ложь);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	&ТекстПолеНомерСтроки                                                               КАК НомерСтроки,
		|	ВЫРАЗИТЬ(МатериалыИУслуги.Номенклатура КАК Справочник.Номенклатура)                 КАК Номенклатура,
		|	ВЫРАЗИТЬ(МатериалыИУслуги.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВЫРАЗИТЬ(МатериалыИУслуги.Подразделение КАК Справочник.СтруктураПредприятия)        КАК Подразделение,
		|	ВЫРАЗИТЬ(МатериалыИУслуги.ПроизводствоНаСтороне КАК БУЛЕВО)                         КАК ПроизводствоНаСтороне,
		|	ВЫРАЗИТЬ(МатериалыИУслуги.Склад КАК Справочник.Склады)                              КАК Склад,
		|	&ТекстПолеПроизводитсяВПроцессе                                                     КАК ПроизводитсяВПроцессе,
		|	&ТекстПолеСпособПолученияМатериала                                                  КАК СпособПолученияМатериала,
		|	ЛОЖЬ                                                                                КАК Обособленно,
		|	&ТекстПолеИсточникПолученияПолуфабриката                                            КАК ИсточникПолученияПолуфабриката
		|ПОМЕСТИТЬ ВТМатериалыИУслуги
		|ИЗ
		|	&ТаблицаМатериалов КАК МатериалыИУслуги
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МатериалыИУслуги.НомерСтроки           КАК НомерСтроки,
		|	МатериалыИУслуги.Номенклатура          КАК Номенклатура,
		|	МатериалыИУслуги.Характеристика        КАК Характеристика,
		|	МатериалыИУслуги.Подразделение         КАК Подразделение,
		|	МатериалыИУслуги.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
		
		// Начало. Склад
		|	ВЫБОР КОГДА МатериалыИУслуги.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ТОГДА
		|		&ТекстПолеСклад
		|	ИНАЧЕ
		|		МатериалыИУслуги.Склад
		|	КОНЕЦ КАК Склад,
		// Конец. Склад
		
		// Начало. Заказать на склад
		|	ВЫБОР 
		|		КОГДА МатериалыИУслуги.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ИЛИ МатериалыИУслуги.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа),
		|																	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
		|			ТОГДА ЛОЖЬ
		|		КОГДА МатериалыИУслуги.ПроизводитсяВПроцессе ТОГДА
		|			ВЫБОР
		//++ Устарело_Производство21 
		|				КОГДА ВЫРАЗИТЬ(МатериалыИУслуги.Подразделение КАК Справочник.СтруктураПредприятия).СпособПолученияПолуфабрикатов = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе.Напрямую)
		|					ТОГДА ЛОЖЬ
		//-- Устарело_Производство21
		|				КОГДА МатериалыИУслуги.ИсточникПолученияПолуфабриката ССЫЛКА Справочник.ЭтапыПроизводства
		|						И ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.ЭтапыПроизводства).Подразделение = МатериалыИУслуги.Подразделение
		|					ТОГДА ЛОЖЬ
		|				КОГДА МатериалыИУслуги.ИсточникПолученияПолуфабриката ССЫЛКА Справочник.ЭтапыПроизводства
		|						И ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.ЭтапыПроизводства).Подразделение <> МатериалыИУслуги.Подразделение
		|					ТОГДА ИСТИНА
		//++ Устарело_Производство21 
		|				КОГДА МатериалыИУслуги.ИсточникПолученияПолуфабриката ССЫЛКА Справочник.РесурсныеСпецификации
		|						И ПроизводимоеВПроцессеИзделие.Этап.Подразделение <> МатериалыИУслуги.Подразделение
		|					ТОГДА ИСТИНА
		//-- Устарело_Производство21
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		//++ Устарело_Производство21
		|		КОГДА &ТекстПолеОснование = ЗНАЧЕНИЕ(Перечисление.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство)
		|				ИЛИ МатериалыИУслуги.ПроизводствоНаСтороне
		|			ТОГДА ИСТИНА
		//-- Устарело_Производство21
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                                       КАК ЗаказатьНаСклад,
		// Конец. Заказать на склад

		// Начало. Вариант обеспечения
		|	&ТекстПолеВариантОбеспечения                                КАК ВариантОбеспечения,
		|	&ТекстПолеОбособленно                                       КАК Обособленно,
		// Конец. Вариант обеспечения
		
		|	&ДатаПотребности КАК ДатаПотребности,
		|	ВЫБОР
		|		КОГДА (&ПодразделениеДиспетчер = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|				ИЛИ ЕСТЬNULL(СпрСпособОбеспечения.ИсточникОбеспеченияПотребностей, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|					В (&ПодразделениеДиспетчер,
		|					   НЕОПРЕДЕЛЕНО,
		|					   ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)))
		|				И ЕСТЬNULL(СпрСпособОбеспечения.ТипОбеспечения, ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                                       КАК Запланировать
		|ИЗ
		|	ВТМатериалыИУслуги КАК МатериалыИУслуги
		|
		|		// Сюда подставляется запрос для получения склада, варианта обеспечения
		|		,ТекстСоединенияПараметрыОбеспечения
		|
		//++ Устарело_Производство21
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК ПроизводимоеВПроцессеИзделие
		|		ПО ПроизводимоеВПроцессеИзделие.Ссылка = МатериалыИУслуги.ИсточникПолученияПолуфабриката
		|			И МатериалыИУслуги.ПроизводитсяВПроцессе
		|			И ПроизводимоеВПроцессеИзделие.Номенклатура = МатериалыИУслуги.Номенклатура
		|			И (ПроизводимоеВПроцессеИзделие.Характеристика = МатериалыИУслуги.Характеристика
		|				ИЛИ ПроизводимоеВПроцессеИзделие.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		//-- Устарело_Производство21
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО ВЫБОР КОГДА МатериалыИУслуги.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ТОГДА
		|				&ТекстПолеСклад
		|			ИНАЧЕ
		|				МатериалыИУслуги.Склад
		|			КОНЕЦ = СпрСклады.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособОбеспечения
		|		ПО &ПодстановкаОсновногоСпособаОбеспечения
		|";
		
	Если ТаблицаМатериалов.Колонки.Найти("ПроизводитсяВПроцессе") <> Неопределено Тогда
		ТекстПолеПроизводитсяВПроцессе = "МатериалыИУслуги.ПроизводитсяВПроцессе";
	Иначе
		ТекстПолеПроизводитсяВПроцессе = "Ложь";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеПроизводитсяВПроцессе",
		ТекстПолеПроизводитсяВПроцессе);
		
	// ТекстПолеНомерСтроки
	Если ТаблицаМатериалов.Колонки.Найти("НомерСтроки") <> Неопределено Тогда
		ТекстПолеНомерСтроки = "МатериалыИУслуги.НомерСтроки";
	Иначе
		ТекстПолеНомерСтроки = "0";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеНомерСтроки",
		ТекстПолеНомерСтроки);
		
	// ТекстПолеСпособПолученияМатериала
	Если ТаблицаМатериалов.Колонки.Найти("СпособПолученияМатериала") <> Неопределено Тогда
		ТекстПолеСпособПолученияМатериала = "МатериалыИУслуги.СпособПолученияМатериала";
	Иначе
		ТекстПолеСпособПолученияМатериала = "ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеСпособПолученияМатериала",
		ТекстПолеСпособПолученияМатериала);
	
	// ТекстПолеИсточникПолученияПолуфабриката
	Если ТаблицаМатериалов.Колонки.Найти("ИсточникПолученияПолуфабриката") <> Неопределено Тогда
		ТекстПолеИсточникПолученияПолуфабриката = "МатериалыИУслуги.ИсточникПолученияПолуфабриката";
	Иначе
		ТекстПолеИсточникПолученияПолуфабриката = 
			"ВЫБОР 
			|	КОГДА ИСТИНА
			|		ТОГДА ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
			|КОНЕЦ";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеИсточникПолученияПолуфабриката",
		ТекстПолеИсточникПолученияПолуфабриката);
		
	ВыполнитьПодстановкуПараметровОбеспеченияМатериалов(ТекстЗапроса,
		"МатериалыИУслуги",
		"СпособПолученияМатериала",,
		ВариантЗаполненияОбеспечения);
		
	ПоляСоединения = "МатериалыИУслуги.Номенклатура, МатериалыИУслуги.Характеристика,СпрСклады.Ссылка";
	ИмяПараметра   = "ПодстановкаОсновногоСпособаОбеспечения";
	
	ТекстЗапроса = РегистрыСведений.СхемыОбеспечения.ПодставитьСоединениеДляПолученияСпособаОбеспечения(
		ТекстЗапроса, ИмяПараметра, ПоляСоединения);

	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ПодразделениеДиспетчер", ДанныеЗаказа.ПодразделениеДиспетчер);
	Запрос.УстановитьПараметр("СкладПоУмолчанию", Справочники.Склады.СкладПоУмолчанию());
	
	Если ДанныеЗаказа.Свойство("ДатаПотребности") Тогда
		Запрос.УстановитьПараметр("ДатаПотребности", ДанныеЗаказа.ДатаПотребности);
	ИначеЕсли ДанныеЗаказа.Свойство("НачатьНеРанее") Тогда
		Запрос.УстановитьПараметр("ДатаПотребности", ДанныеЗаказа.НачатьНеРанее);
	Иначе
		Запрос.УстановитьПараметр("ДатаПотребности", '00010101');
	КонецЕсли;
	
	Если ДанныеЗаказа.Свойство("Распоряжение") Тогда
		Запрос.УстановитьПараметр("Распоряжение", ДанныеЗаказа.Распоряжение);
	Иначе
		Запрос.УстановитьПараметр("Распоряжение", Неопределено);
	КонецЕсли;
	
	Если ДанныеЗаказа.Свойство("Назначение") Тогда
		Запрос.УстановитьПараметр("Назначение", ДанныеЗаказа.Назначение);
	Иначе
		Запрос.УстановитьПараметр("Назначение", Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаМатериалов", ТаблицаМатериалов);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, "ВТМатериалыИУслуги");
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ТекстыЗапросов

// Возвращает текст запроса с помощью которого можно получить склад материалов.
//
// Параметры:
//  ИмяТаблицыМатериалы			 - Строка - Псевдоним таблицы "материалов". Таблица должна содержать
//		поля Номенклатура, Характеристика, Подразделение (не обязательно).
//  ИмяПоляПодразделение		 - Строка - Имя поля "Подразделение" в таблице материалов.
//		Если подразделение определяется параметром, то перед именем нужно добавить "&".
//  ВариантЗаполненияОбеспечения	 - ПеречислениеСсылка.ВариантыЗаполненияОбеспеченияПроизводства - Вариант заполнения обеспечения
// 
// Возвращаемое значение:
//  Структура - содержит тексты запросов:
//  	* ТекстПолеСклад - Строка - текст для получения поля "Склад".
//++ Устарело_Производство21
//  	* ТекстПолеОснование - Строка - текст для получения поля "ОснованиеДляПолучения".
//-- Устарело_Производство21
//  	* ТекстСоединения - Строка - текст соединений.
//
Функция ТекстЗапросаНастройкиПередачиМатериалов(ИмяТаблицыМатериалы, ИмяПоляПодразделение = Неопределено, ВариантЗаполненияОбеспечения = Неопределено) Экспорт
	
	Если ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.НеЗаполнять Тогда
		
		ТекстПолеСклад     = "ЛОЖЬ";
		//++ Устарело_Производство21
		ТекстПолеОснование = "ЛОЖЬ";
		//-- Устарело_Производство21
		ТекстСоединения    = "";
		
	Иначе
		
		//++ Устарело_Производство21	
		Если ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения Тогда
		//-- Устарело_Производство21	
			
			ТекстПолеСклад = 
			"ВЫБОР
			|	КОГДА ЕСТЬNULL(НастройкаДетальная.МетодОбеспеченияПотребностей, 
			|			ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, 
			|			ЕСТЬNULL(НастройкаОбщая.МетодОбеспеченияПотребностей, 
			|			ЕСТЬNULL(НастройкаГруппировкиОбщейНастройки.МетодОбеспеченияПотребностей, NULL)))) В (
			|					ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаМинМакс),
			|					ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаНаСрокПоНорме),
			|					ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаНаСрокПоСтатистике))
			|		ТОГДА ЕСТЬNULL(НастройкаДетальная.Склад, 
			|			ЕСТЬNULL(ПринадлежностьГруппе.Склад, 
			|			ЕСТЬNULL(НастройкаОбщая.Склад, 
			|			ЕСТЬNULL(ПринадлежностьГруппеОбщейНастройки.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)))))
			|	ИНАЧЕ ЕСТЬNULL(СхемыОбеспеченияПроизводства.Склад, &СкладПоУмолчанию)
			|КОНЕЦ";
			
			//++ Устарело_Производство21
			ТекстПолеОснование = 
				"ЗНАЧЕНИЕ(Перечисление.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство)";
			//-- Устарело_Производство21
			
			ТекстСоединения = "
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспеченияПроизводства КАК СхемыОбеспеченияПроизводства
			|		ПО ТаблицаМатериалы.Номенклатура.СхемаОбеспечения = СхемыОбеспеченияПроизводства.СхемаОбеспечения
			|			И ТаблицаМатериалы.Подразделение = СхемыОбеспеченияПроизводства.Подразделение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
			|		ПО &ПодстановкаТоварногоОграничения";
			
			ПоляСоединенияТоварныеОграничения = 
				"ТаблицаМатериалы.Номенклатура,ТаблицаМатериалы.Характеристика,ТаблицаМатериалы.Подразделение";
			
			ТекстСоединения = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединениеПоддержанияЗапасовВКладовых(
									ТекстСоединения, "ПодстановкаТоварногоОграничения", ПоляСоединенияТоварныеОграничения);
		//++ Устарело_Производство21
		Иначе
			
			ТекстПолеСклад = 
			"ЕСТЬNULL(НастройкаПередачиХарактеристика.Склад,
			|				ЕСТЬNULL(НастройкаПередачиНоменклатура.Склад, 
			|				ЕСТЬNULL(НастройкаПередачиСклад.Склад, &СкладПоУмолчанию)))";
			
			ТекстПолеОснование = 
			"ЕСТЬNULL(НастройкаПередачиХарактеристика.ОснованиеДляПолучения,
			|				ЕСТЬNULL(НастройкаПередачиНоменклатура.ОснованиеДляПолучения,
			|				ЕСТЬNULL(НастройкаПередачиСклад.ОснованиеДляПолучения,
			|						ЗНАЧЕНИЕ(Перечисление.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство))))";
						
			ТекстСоединения = "
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПередачиМатериаловВПроизводство КАК НастройкаПередачиХарактеристика
			|		ПО ТаблицаМатериалы.Подразделение = НастройкаПередачиХарактеристика.Подразделение
			|			И ТаблицаМатериалы.Номенклатура = НастройкаПередачиХарактеристика.Номенклатура
			|			И ТаблицаМатериалы.Характеристика = НастройкаПередачиХарактеристика.Характеристика
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПередачиМатериаловВПроизводство КАК НастройкаПередачиНоменклатура
			|		ПО ТаблицаМатериалы.Подразделение = НастройкаПередачиНоменклатура.Подразделение
			|			И ТаблицаМатериалы.Номенклатура = НастройкаПередачиНоменклатура.Номенклатура
			|			И (НастройкаПередачиНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПередачиМатериаловВПроизводство КАК НастройкаПередачиСклад
			|		ПО ТаблицаМатериалы.Подразделение = НастройкаПередачиСклад.Подразделение
			|			И (НастройкаПередачиСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			|			И (НастройкаПередачиСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
			|			И (НастройкаПередачиХарактеристика.Подразделение ЕСТЬ NULL )
			|			И (НастройкаПередачиНоменклатура.Подразделение ЕСТЬ NULL )";
			
		КонецЕсли;
		//-- Устарело_Производство21
		
		Если ИмяПоляПодразделение <> Неопределено Тогда
			Если Лев(ИмяПоляПодразделение, 1) = "&" Тогда
				ТекстСоединения = СтрЗаменить(ТекстСоединения, "ТаблицаМатериалы.Подразделение", ИмяПоляПодразделение);
			ИначеЕсли ИмяПоляПодразделение <> "Подразделение" Тогда
				ТекстСоединения = СтрЗаменить(ТекстСоединения, "ТаблицаМатериалы.Подразделение", "ТаблицаМатериалы." + ИмяПоляПодразделение);
			КонецЕсли; 
		КонецЕсли;
		
		Если ИмяТаблицыМатериалы <> "ТаблицаМатериалы" Тогда
			ТекстПолеСклад  = СтрЗаменить(ТекстПолеСклад,  "ТаблицаМатериалы", ИмяТаблицыМатериалы);
			ТекстСоединения = СтрЗаменить(ТекстСоединения, "ТаблицаМатериалы", ИмяТаблицыМатериалы);
		КонецЕсли;
		
	КонецЕсли;
	
	ШаблоныЗапроса = Новый Структура;
	ШаблоныЗапроса.Вставить("ТекстПолеСклад",     ТекстПолеСклад);
	//++ Устарело_Производство21
	ШаблоныЗапроса.Вставить("ТекстПолеОснование", ТекстПолеОснование);
	//-- Устарело_Производство21
	ШаблоныЗапроса.Вставить("ТекстСоединения",    ТекстСоединения);
	
	Возврат ШаблоныЗапроса;
	
КонецФункции

// Формирует текст запроса инициализирующий временную таблицу ВтСпособыПолученияМатериалов.
// 
// Возвращаемое значение:
//   - Строка - текст запроса
//
Функция ТекстЗапросаВТСпособыПолученияМатериаловПустая() Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)      КАК Распоряжение,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)                 КАК Назначение,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                     КАК Склад,
		|	ИСТИНА                                                       КАК Обособленно
		|ПОМЕСТИТЬ ВтСпособыПолученияМатериалов
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса для получения полей Склад, ВариантОбеспечения
//
// Параметры:
//  ИмяТаблицыМатериалы			 - Строка - Псевдоним таблицы "материалов". Таблица должна содержать
//		поля Номенклатура, Характеристика, Подразделение (не обязательно).
//  ИмяПоляСпособПолученияМатериала	 - Строка - имя поля в котором содержится способ получения.
//  ИмяПоляПодразделение			 - Строка - имя поля в котором содержится ссылка на подразделение,
//		например "Этап.Подразделение".
//  ВариантЗаполненияОбеспечения	 - ПеречислениеСсылка.ВариантыЗаполненияОбеспеченияПроизводства - Вариант заполнения обеспечения
// 
// Возвращаемое значение:
//  Структура - содержит тексты запросов:
//  	* ТекстПолеСклад - Строка - текст для получения поля "Склад".
//  	* ТекстПолеВариантОбеспечения - Строка - текст для получения поля "ВариантОбеспечения".
//++ Устарело_Производство21
//  	* ТекстПолеОснование - Строка - текст для получения поля "ОснованиеДляПолучения".
//-- Устарело_Производство21
//  	* ТекстСоединения - Строка - текст соединений.
//
Функция ТекстЗапросаПараметрыОбеспечения(ИмяТаблицыМатериалы, ИмяПоляСпособПолученияМатериала = Неопределено, ИмяПоляПодразделение = Неопределено, ВариантЗаполненияОбеспечения = Неопределено)
	
	Если ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.НеЗаполнять Тогда
		
		ТекстПолеСклад              = "ЛОЖЬ";
		ТекстПолеВариантОбеспечения = "ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)";
		ТекстПолеОбособленно        = "ЛОЖЬ";
		//++ Устарело_Производство21
		ТекстПолеОснование          = "ЛОЖЬ";
		//-- Устарело_Производство21
		ТекстСоединения             = "";
		
	Иначе
		
		//++ Устарело_Производство21
		Если ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения Тогда
		//-- Устарело_Производство21
			
			// В версии 2.2. 
			// - ПФ всегда идут через склад
			// - Для получения склада используются схемы обеспечения
			
			// Склад
			#Область ТекстПолеСклад
			ТекстПолеСклад =
			"ВЫБОР
			|		КОГДА МатериалыИУслуги.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|				ИЛИ ВЫРАЗИТЬ(МатериалыИУслуги.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры В (
			|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа),
			|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|		КОГДА НЕ ПереопределениеОбеспечения1.Склад ЕСТЬ NULL
			|				И ПереопределениеОбеспечения1.Склад <> НЕОПРЕДЕЛЕНО
			|			ТОГДА ПереопределениеОбеспечения1.Склад
			|		ИНАЧЕ &ТекстПоляСкладМатериалов
			|	КОНЕЦ";
			#КонецОбласти
			
			// ВариантОбеспечения
			#Область ТекстПолеВариантОбеспечения
			
			ТекстПолеВариантОбеспечения = 
			"ВЫБОР
			|		КОГДА МатериалыИУслуги.СпособПолученияМатериала В (ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации),
			|															ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)) ТОГДА
			|
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
			|			
			|		КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)
			|				И МатериалыИУслуги.Обособленно ТОГДА
			|
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
			|
			|		КОГДА МатериалыИУслуги.Номенклатура.ОбособленнаяЗакупкаПродажа ТОГДА
			|
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
			|
			|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа),
			|																ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) ТОГДА
			|			
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
			|
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
			|	
			|	КОНЕЦ";
			
			#КонецОбласти
		
			// Обособленно
			#Область Обособленно
			
			ТекстПолеОбособленно =
			"ВЫБОР
			|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара) ТОГДА
			|			
			|			ЛОЖЬ
			|		
			|		КОГДА НЕ ПереопределениеОбеспечения1.Обособленно ЕСТЬ NULL
			|			И ПереопределениеОбеспечения1.Обособленно <> НЕОПРЕДЕЛЕНО ТОГДА
			|
			|			ПереопределениеОбеспечения1.Обособленно
			|		
			|		КОГДА НЕ ПереопределениеОбеспечения2.Обособленно ЕСТЬ NULL
			|			И ПереопределениеОбеспечения2.Обособленно <> НЕОПРЕДЕЛЕНО ТОГДА
			|
			|			ПереопределениеОбеспечения2.Обособленно
			|
			|		КОГДА МатериалыИУслуги.Номенклатура.ОбособленнаяЗакупкаПродажа ТОГДА
			|
			|			ИСТИНА
			|
			|		КОГДА МатериалыИУслуги.Обособленно ТОГДА
			|
			|			ИСТИНА
			|";
			
				ТекстПолеОбособленно = ТекстПолеОбособленно + "
				|		
				|		ИНАЧЕ ЛОЖЬ
				|	
				|	КОНЕЦ";
			
			#КонецОбласти
		//++ Устарело_Производство21
		Иначе // По настройкам передачи в производство
			
			// Склад
			#Область ТекстПолеСклад
			ТекстПолеСклад =
			"ВЫБОР 
			|		КОГДА МатериалыИУслуги.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ИЛИ МатериалыИУслуги.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа),
			|																ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|		КОГДА НЕ ПереопределениеОбеспечения.Склад ЕСТЬ NULL ТОГДА
			|			ПереопределениеОбеспечения.Склад";
			
			Если ИмяПоляСпособПолученияМатериала <> Неопределено Тогда
				ТекстПолеСклад = ТекстПолеСклад + "
				|		КОГДА МатериалыИУслуги.СпособПолученияМатериала В (ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации),
				|															ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)) ТОГДА
				|			ВЫБОР
				|				КОГДА СпрПодразделение.СпособПолученияПолуфабрикатов = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе.Напрямую)
				|					ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|				КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)
				|						И ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.ЭтапыПроизводства).Подразделение = МатериалыИУслуги.Подразделение
				|					ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|				КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)
				|						И ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.ЭтапыПроизводства).Подразделение <> МатериалыИУслуги.Подразделение
				|					ТОГДА &ТекстПоляСкладМатериалов
				|				КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации)
				|						И ПроизводимоеВПроцессеИзделие.Этап.Подразделение <> МатериалыИУслуги.Подразделение
				|					ТОГДА &ТекстПоляСкладМатериалов
				|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|			КОНЕЦ";
			КонецЕсли; 
			
			Если ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоНастройкамПередачиВПроизводствоДляПланов Тогда
				
				ТекстПолеСклад = ТекстПолеСклад + "
				|		ИНАЧЕ &ТекстПоляСкладМатериалов
				|	КОНЕЦ";
				
			Иначе
				
				ТекстПолеСклад = ТекстПолеСклад + "
				|		КОГДА &ТекстПолеОснование = ЗНАЧЕНИЕ(Перечисление.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство)
				|			ТОГДА &ТекстПоляСкладМатериалов
				|		КОГДА ИСТИНА
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|	КОНЕЦ";
				
			КонецЕсли;
			#КонецОбласти
			
			// ВариантОбеспечения
			#Область ТекстПолеВариантОбеспечения
			ТекстПолеВариантОбеспечения = "ВЫБОР";
			ТекстПолеОбособленно = "ВЫБОР";
			Если ИмяПоляСпособПолученияМатериала <> Неопределено Тогда
				ТекстПолеВариантОбеспечения = ТекстПолеВариантОбеспечения + "
				|		КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)
				|				И МатериалыИУслуги.Обособленно
				|
				|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
				|
				|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа),
				|																ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) ТОГДА
				|			
				|			ВЫБОР 
				|				КОГДА МатериалыИУслуги.Номенклатура.ОбособленнаяЗакупкаПродажа 
				|						ИЛИ МатериалыИУслуги.СпособПолученияМатериала В (ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации),
				|																			ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе))
				|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
				|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
				|			КОНЕЦ
				|			
				|		КОГДА МатериалыИУслуги.СпособПолученияМатериала В (ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации),
				|															ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)) ТОГДА
				|			ВЫБОР
				|				КОГДА МатериалыИУслуги.Подразделение.СпособПолученияПолуфабрикатов = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе.Напрямую)
				|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
				|				КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)
				|						И ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.ЭтапыПроизводства).Подразделение = МатериалыИУслуги.Подразделение
				|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
				|				КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)
				|						И ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.ЭтапыПроизводства).Подразделение <> МатериалыИУслуги.Подразделение
				|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
				|				КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации)
				|						И ПроизводимоеВПроцессеИзделие.Этап.Подразделение <> МатериалыИУслуги.Подразделение
				|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
				|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
				|			КОНЕЦ";
				
				ТекстПолеОбособленно = ТекстПолеОбособленно + "
				|		КОГДА МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)
				|				И МатериалыИУслуги.Обособленно
				|	
				|			ТОГДА ИСТИНА
				|		
				|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа),
				|																ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) ТОГДА
				|			
				|			ВЫБОР 
				|				КОГДА МатериалыИУслуги.Номенклатура.ОбособленнаяЗакупкаПродажа 
				|						ИЛИ МатериалыИУслуги.СпособПолученияМатериала В (ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации),
				|																			ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе))
				|					ТОГДА ИСТИНА
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ
				|			
				|		КОГДА МатериалыИУслуги.СпособПолученияМатериала В (ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации),
				|															ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе))
				|		
				|			ТОГДА ИСТИНА
				|			
				|";
			КонецЕсли;
			
			ТекстПолеВариантОбеспечения = ТекстПолеВариантОбеспечения + "
			|
			|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара) ТОГДА
			|			
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
			|			
			|		КОГДА НЕ ПереопределениеОбеспечения.Номенклатура ЕСТЬ NULL ТОГДА
			|
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
			|		
			|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
			|				И &ТекстПолеОснование = ЗНАЧЕНИЕ(Перечисление.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство) ТОГДА
			|		
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
			|	
			|		ИНАЧЕ
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
			|	КОНЕЦ";
			
			ТекстПолеОбособленно = ТекстПолеОбособленно + "
			|
			|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара) ТОГДА
			|			
			|			ЛОЖЬ
			|		
			|		КОГДА НЕ ПереопределениеОбеспечения.Номенклатура ЕСТЬ NULL ТОГДА
			|
			|			ПереопределениеОбеспечения.Обособленно
			|		
			|		КОГДА МатериалыИУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
			|				И &ТекстПолеОснование = ЗНАЧЕНИЕ(Перечисление.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство) ТОГДА
			|		
			|			МатериалыИУслуги.Номенклатура.ОбособленнаяЗакупкаПродажа 
			|	
			|		ИНАЧЕ
			|			ЛОЖЬ
			|	КОНЕЦ";
			
			#КонецОбласти
			
		КонецЕсли;
		//-- Устарело_Производство21
		
		ТекстЗапросаДляПолученияСклада = ТекстЗапросаНастройкиПередачиМатериалов(
											ИмяТаблицыМатериалы, 
											ИмяПоляПодразделение,
											ВариантЗаполненияОбеспечения);
											
		ТекстПолеСклад = СтрЗаменить(
							ТекстПолеСклад, 
							"&ТекстПоляСкладМатериалов",
							ТекстЗапросаДляПолученияСклада.ТекстПолеСклад);
		
		//++ Устарело_Производство21
		ТекстПолеОснование = ТекстЗапросаДляПолученияСклада.ТекстПолеОснование;
							
		ТекстПолеСклад = СтрЗаменить(
							ТекстПолеСклад, 
							"&ТекстПолеОснование",
							ТекстПолеОснование);
		
		ТекстПолеВариантОбеспечения = СтрЗаменить(
							ТекстПолеВариантОбеспечения, 
							"&ТекстПолеОснование",
							ТекстПолеОснование);
		
		ТекстПолеОбособленно = СтрЗаменить(
							ТекстПолеОбособленно, 
							"&ТекстПолеОснование",
							ТекстПолеОснование);
		//-- Устарело_Производство21
		
		//++ Устарело_Производство21
		Если ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения Тогда
		//-- Устарело_Производство21
			
			ТекстСоединения = ТекстЗапросаДляПолученияСклада.ТекстСоединения + " 
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСпособыПолученияМатериалов КАК ПереопределениеОбеспечения1
			|		ПО ПереопределениеОбеспечения1.Номенклатура = МатериалыИУслуги.Номенклатура
			|			И ПереопределениеОбеспечения1.Характеристика = МатериалыИУслуги.Характеристика
			|			И ПереопределениеОбеспечения1.Распоряжение = &Распоряжение
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСпособыПолученияМатериалов КАК ПереопределениеОбеспечения2
			|		ПО ПереопределениеОбеспечения2.Распоряжение = &Распоряжение
			|			И ПереопределениеОбеспечения2.Номенклатура = НЕОПРЕДЕЛЕНО
			|			И ПереопределениеОбеспечения2.Характеристика = НЕОПРЕДЕЛЕНО
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СпрПодразделение
			|		ПО СпрПодразделение.Ссылка = МатериалыИУслуги.Подразделение";
		
		//++ Устарело_Производство21
		Иначе
			
			ТекстСоединения = ТекстЗапросаДляПолученияСклада.ТекстСоединения + " 
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСпособыПолученияМатериалов КАК ПереопределениеОбеспечения
			|		ПО ПереопределениеОбеспечения.Номенклатура = МатериалыИУслуги.Номенклатура
			|			И ПереопределениеОбеспечения.Характеристика = МатериалыИУслуги.Характеристика
			|			И ПереопределениеОбеспечения.Распоряжение = &Распоряжение
			|			И ПереопределениеОбеспечения.Назначение = &Назначение
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СпрПодразделение
			|		ПО СпрПодразделение.Ссылка = МатериалыИУслуги.Подразделение";
			
		КонецЕсли;
		//-- Устарело_Производство21
		
		Если ИмяПоляСпособПолученияМатериала <> Неопределено 
			И ИмяПоляСпособПолученияМатериала <> "СпособПолученияМатериала" Тогда
			
			ТекстПолеСклад = СтрЗаменить(
				ТекстПолеСклад,
				"МатериалыИУслуги.СпособПолученияМатериала",
				"МатериалыИУслуги." + ИмяПоляСпособПолученияМатериала);
			
			ТекстПолеВариантОбеспечения = СтрЗаменить(
				ТекстПолеВариантОбеспечения,
				"МатериалыИУслуги.СпособПолученияМатериала",
				"МатериалыИУслуги." + ИмяПоляСпособПолученияМатериала);
			
			//++ Устарело_Производство21
			ТекстПолеОбособленно = СтрЗаменить(
								ТекстПолеОбособленно, 
								"&ТекстПолеОснование",
								ТекстПолеОснование);
			//-- Устарело_Производство21
		
		КонецЕсли;
			
		Если ИмяПоляПодразделение <> Неопределено Тогда 
			
			Если Лев(ИмяПоляПодразделение, 1) = "&" Тогда
				
				ТекстПолеСклад = СтрЗаменить(
					ТекстПолеСклад,
					"МатериалыИУслуги.Подразделение",
					ИмяПоляПодразделение);
				
				ТекстПолеВариантОбеспечения = СтрЗаменить(
					ТекстПолеВариантОбеспечения,
					"МатериалыИУслуги.Подразделение",
					ИмяПоляПодразделение);
					
				ТекстПолеОбособленно = СтрЗаменить(
					ТекстПолеОбособленно,
					"МатериалыИУслуги.Подразделение",
					ИмяПоляПодразделение);
					
				ТекстСоединения = СтрЗаменить(
					ТекстСоединения,
					"МатериалыИУслуги.Подразделение",
					ИмяПоляПодразделение);
					
			ИначеЕсли ИмяПоляПодразделение <> "Подразделение" Тогда
				
				ТекстПолеСклад = СтрЗаменить(
					ТекстПолеСклад,
					"МатериалыИУслуги.Подразделение",
					"МатериалыИУслуги." + ИмяПоляПодразделение);
				
				ТекстПолеВариантОбеспечения = СтрЗаменить(
					ТекстПолеВариантОбеспечения,
					"МатериалыИУслуги.Подразделение",
					"МатериалыИУслуги." + ИмяПоляПодразделение);
					
				ТекстПолеОбособленно = СтрЗаменить(
					ТекстПолеОбособленно,
					"МатериалыИУслуги.Подразделение",
					"МатериалыИУслуги." + ИмяПоляПодразделение);
					
				ТекстСоединения = СтрЗаменить(
					ТекстСоединения,
					"МатериалыИУслуги.Подразделение",
					"МатериалыИУслуги." + ИмяПоляПодразделение);
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИмяТаблицыМатериалы <> "МатериалыИУслуги" Тогда
			ТекстПолеСклад              = СтрЗаменить(ТекстПолеСклад,              "МатериалыИУслуги", ИмяТаблицыМатериалы);
			ТекстПолеВариантОбеспечения = СтрЗаменить(ТекстПолеВариантОбеспечения, "МатериалыИУслуги", ИмяТаблицыМатериалы);
			ТекстПолеОбособленно        = СтрЗаменить(ТекстПолеОбособленно,        "МатериалыИУслуги", ИмяТаблицыМатериалы);
			ТекстСоединения             = СтрЗаменить(ТекстСоединения,             "МатериалыИУслуги", ИмяТаблицыМатериалы);
		КонецЕсли;
		
	КонецЕсли;

	ШаблоныЗапроса = Новый Структура();
	ШаблоныЗапроса.Вставить("ТекстПолеСклад",              ТекстПолеСклад);
	ШаблоныЗапроса.Вставить("ТекстПолеВариантОбеспечения", ТекстПолеВариантОбеспечения);
	ШаблоныЗапроса.Вставить("ТекстПолеОбособленно",        ТекстПолеОбособленно);
	//++ Устарело_Производство21
	ШаблоныЗапроса.Вставить("ТекстПолеОснование",          ТекстПолеОснование);
	//-- Устарело_Производство21
	ШаблоныЗапроса.Вставить("ТекстСоединения",             ТекстСоединения);

	Возврат ШаблоныЗапроса;
	
КонецФункции

Процедура ВыполнитьПодстановкуПараметровОбеспеченияМатериалов(ТекстЗапроса,
	ИмяТаблицы,
	ИмяПоляСпособПолученияМатериала = Неопределено,
	ИмяПоляПодразделение = Неопределено,
	ВариантЗаполненияОбеспечения = Неопределено) Экспорт
	
	ТекстыПараметрыОбеспечения = ТекстЗапросаПараметрыОбеспечения(
		ИмяТаблицы,
		ИмяПоляСпособПолученияМатериала,
		ИмяПоляПодразделение,
		ВариантЗаполненияОбеспечения);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		",ТекстСоединенияПараметрыОбеспечения",
		ТекстыПараметрыОбеспечения.ТекстСоединения);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеСклад",
		ТекстыПараметрыОбеспечения.ТекстПолеСклад);
	
	//++ Устарело_Производство21
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеОснование",
		ТекстыПараметрыОбеспечения.ТекстПолеОснование);
	//-- Устарело_Производство21
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеВариантОбеспечения",
		ТекстыПараметрыОбеспечения.ТекстПолеВариантОбеспечения);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстПолеОбособленно",
		ТекстыПараметрыОбеспечения.ТекстПолеОбособленно);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ВариантЗаполненияОбеспеченияПоВерсииПроизводства(Знач ИспользоватьПроизводство2_2 = Неопределено) Экспорт
	
	Если ИспользоватьПроизводство2_2 = Неопределено Тогда
		ИспользоватьПроизводство2_2 = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2")
	КонецЕсли;
	
	Если ИспользоватьПроизводство2_2 Тогда
		Возврат Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения;
	//++ Устарело_Производство21	
	Иначе
		Возврат Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоНастройкамПередачиВПроизводство;
	//-- Устарело_Производство21	
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
